# - 사전 자료형은 키와 값의 쌍으로 데이터로 가지는 자료형입니다.
#   - 앞서 다루었던 리스트나 튜플이 값을 순차적으로 저장하는 것과는 대비됩니다.
# - 사전 자료형은 키와 값의 쌍을 데이터로 가지며, 원하는 변경 불가능한 자료형을 키로 사용할 수 있습니다.
# - 파이썬의 사전 자료형은 해시 테이블을 이용하므로 데이터의 조회 및 수정에 있어서 O(1)의 시간에 처리할 수 있습니다.

data = dict()
data = dict()
data['사과'] = 'Apple'
data['바나나'] = 'Banana'
data['코코넛'] = 'Coconut'

print(data)

if '사과' in data:
    print("'사과'를 키로 가지는 데이터가 존재합니다.")

#사전 자료형 관련 메서드
# - 사전 자료형에서는 키와 값을 별도로 뽑아내기 위한 메서드를 지원합니다.
#   - 키 데이터만 뽑아서 리스트로 이용할 때는 keys() 함수를 이용합니다.
#   - 값 데이터만을 뽑아서 리스트로 이용할 때는 values() 함수를 이용합니다.

# 키 데이터만 담은 리스트
print(data.keys())
print(list(data.keys()))

# 값 데이터만 담은 리스트
print(data.values())

# 각 키에 따른 값을 하나씩 출력
for key in data.keys():
   print(key)